// ПодключаемоеОборудование
Перем глПодключаемоеОборудование Экспорт; // для кэширования на клиенте
// Конец ПодключаемоеОборудование

#Область ОбработчикиСобытий

Процедура ПриНачалеРаботыСистемы()
	
	// ПодключаемоеОборудование
	МенеджерОборудованияКлиент.ПриНачалеРаботыСистемы();
	// Конец ПодключаемоеОборудование
	УГМК_МобильныйКлиентСервер.ПодключитьСобытиеОповещения();
КонецПроцедуры
	
	

Процедура ПередНачаломРаботыСистемы(Отказ)
	//
	//ПервыйЗапуск = ОбщегоНазначенияВызовСервера.ОбработатьЗапускПриложения();
	//
	//Если ПервыйЗапуск Тогда
	//	
	//	РезервноеКопированиеКлиент.УстановитьПутьРезервногоКопированияПриПервомЗапуске();
	//	
	//	ОбщегоНазначенияВызовСервера.УстановитьРежимСинхронизацииДемоверсии();
	//	
	//	ПараметрыФормы = Новый Структура("ПервыйЗапуск", ПервыйЗапуск);
	//	ОткрытьФорму("Обработка.НастройкиПриложения.Форма.РежимСинхронизации", ПараметрыФормы,,,,,,РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
	//	
	//КонецЕсли;
	//
	//ОбщегоНазначенияВызовСервера.ОбновитьПриложение();
	//
	
	// ПодключаемоеОборудование
	МенеджерОборудованияВызовСервераПереопределяемый.ОбновлениеБиблиотеки();
	// Конец ПодключаемоеОборудование
	
КонецПроцедуры

Процедура ПередЗавершениемРаботыСистемы(Отказ)
	
	// ПодключаемоеОборудование
	МенеджерОборудованияКлиент.ПередЗавершениемРаботыСистемы();
	// Конец ПодключаемоеОборудование

КонецПроцедуры

#КонецОбласти