
&НаКлиенте
Процедура Проверить(Команда)
		
	РезультатПроверки = ПроверитьСервер();
	Если РезультатПроверки.Результат Тогда
		Предупреждение("Сервис подключен успешно");
	Иначе
		Предупреждение(РезультатПроверки.Сообщение);
	КонецЕсли;	
КонецПроцедуры

&НаСервере
Функция ПроверитьСервер()
	Результат = Ложь;
	Попытка
		//ВСОпределение = Новый WSОпределения("http://10.35.4.172:4443/center/ws/MobileTransfer.1cws?wsdl","update1c","St7658"); 
		ВСОпределение = Новый WSОпределения(НаборКонстант.АдресВебСервиса,НаборКонстант.ПользовательЦентральнойБазы,НаборКонстант.ПарольПользователя); 
		Сообщение = "Подключено!";
		Результат = Истина;
	Исключение
		Сообщение = ОписаниеОшибки();
	КонецПопытки;	
	СтруктураОтвета = Новый Структура;
	СтруктураОтвета.Вставить("Сообщение", Сообщение);
	СтруктураОтвета.Вставить("Результат", Результат);
	Возврат СтруктураОтвета;
КонецФункции


&НаКлиенте
Процедура ПолучитьНастройкиПоУмолчанию(Команда)
		НаборКонстант.АдресВебСервиса = "http://10.35.4.91:4481/tou_kav/ws/MobileTransfer.1cws?wsdl";
		НаборКонстант.ПользовательЦентральнойБазы = "update1c";
		НаборКонстант.ПарольПользователя = "St7658"; 
КонецПроцедуры


&НаСервере
Процедура СохранитьНаСервере()
	Константы.АдресВебСервиса.Установить(НаборКонстант.АдресВебСервиса);
	Константы.ПарольПользователя.Установить(НаборКонстант.ПарольПользователя);
	Константы.ПользовательЦентральнойБазы.Установить(НаборКонстант.ПользовательЦентральнойБазы);
КонецПроцедуры


&НаКлиенте
Процедура Сохранить(Команда)
	СохранитьНаСервере();
КонецПроцедуры



#Если  МобильноеПриложениеКлиент  тогда

&НаКлиенте
Процедура ПрочитатьШК(Команда)
	СтартСканировать();
КонецПроцедуры


&НаКлиенте
Процедура СтартСканировать()
	Если НЕ СредстваМультимедиа.ПоддерживаетсяСканированиеШтрихКодов() Тогда
		Сообщить("не поддерживает сканирование штрихкода");
		Возврат;
	КонецЕсли; 	
	ОбработчикСканирования = Новый ОписаниеОповещения("ОбработкаСканирования", ЭтотОбъект);
	ОбработчикЗакрытия = Новый ОписаниеОповещения("ОбработкаЗакрытияИнтерфейса", ЭтотОбъект);
	СредстваМультимедиа.ПоказатьСканированиеШтрихКодов("Наведите камеру на штрихкод", ОбработчикСканирования, ОбработчикЗакрытия,ТипШтрихКода.Все);
КонецПроцедуры



&НаКлиенте
Процедура ОбработкаСканирования(Штрихкод, Результат, Сообщение, ДополнительныеПараметры) Экспорт
	Перем СтрокаШтрихкода1;
	Если Результат Тогда
		СтрокаШтрихкода1 = СтрЗаменить( Штрихкод, Символы.ВК, "");
		СтрокаШтрихкода1 = СтрЗаменить( СтрокаШтрихкода1, Символы.ПС, "");
		ТекстПредупреждения = "";
		ТекстШапкиПредупреждения = "";
		//Сообщить(СтрокаШтрихкода1);
	КонецЕсли;	
	СредстваМультимедиа.ЗакрытьСканированиеШтрихКодов();
	//НаборКонстант.АдресВебСервиса = "http://10.35.4.172:4443/tou_kav+ "/ws/MobileTransfer.1cws?wsdl";
	НаборКонстант.АдресВебСервиса = СтрокаШтрихкода1;
	НаборКонстант.ПользовательЦентральнойБазы = "update1c";
	НаборКонстант.ПарольПользователя = "St7658"; 
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаЗакрытияИнтерфейса(ДополнительныеПараметры) Экспорт
	//Сообщить("Закрывается интерфейс сканирования");
КонецПроцедуры

#КонецЕсли



#Область ОбработчикиСобытийФормы


&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	НаборКонстант.АдресВебСервиса = Константы.АдресВебСервиса.Получить();
	НаборКонстант.ПарольПользователя = Константы.ПарольПользователя.Получить();
	НаборКонстант.ПользовательЦентральнойБазы = Константы.ПользовательЦентральнойБазы.Получить();
	НастроитьФормуПоЗначениямНастроек();
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "ИзмененыЗначенияНастроек" ИЛИ ИмяСобытия = "ВыполненОбмен" Тогда
		
		НастроитьФормуПоЗначениямНастроек();
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура НастроитьФормуПоЗначениямНастроек()
	
	ОбщегоНазначения.УстановитьШрифт(ЭтаФорма);
	
КонецПроцедуры

#КонецОбласти

