#Область ПрограммныйИнтерфейс

// Переопределяемя процедура вызывается после открытия чека.
//
Процедура ПечатьЧекаПослеОткрытияЧека(ПараметрыВыполнения) Экспорт
	
	ПараметрыВыполнения.ПродолжитьПечать = Истина;
	ПараметрыВыполнения.ТекстОшибки = Неопределено;
	ПараметрыВыполнения.АдресЧека   = Неопределено;
	ПараметрыВыполнения.ПодписьЧека = Неопределено;

КонецПроцедуры

// Переопределяемя процедура вызывается при ошибке печати чека.
//
Функция ПечатьЧекаПриОшибкеПечати(ПараметрыВыполнения) Экспорт
	
КонецФункции

#КонецОбласти
