
#Область ПрограммныйИнтерфейс

Функция ФорматСуммовыхПолей() Экспорт
	
	ФорматПолей = "ЧЦ=15; ЧДЦ=2; ЧРД=.; ЧН=0.00; ЧГ=0";
	
	Возврат ФорматПолей;
	
КонецФункции

Функция ПолучитьСоздатьЕдиницуИзмерения(Наименование) Экспорт
	
	Если НЕ ЗначениеЗаполнено(Наименование) Тогда
		Наименование ="шт";
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	ЕдиницыИзмерения.Ссылка
	|ИЗ
	|	Справочник.ЕдиницыИзмерения КАК ЕдиницыИзмерения
	|ГДЕ
	|	ЕдиницыИзмерения.Наименование ПОДОБНО &Наименование";
	
	Запрос.УстановитьПараметр("Наименование", Наименование);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Если Выборка.Следующий() Тогда
		ЕдиницаИзмерения = Выборка.Ссылка;
	Иначе
		ЕдиницаИзмеренияОбъект = Справочники.ЕдиницыИзмерения.СоздатьЭлемент();
		ЕдиницаИзмеренияОбъект.Наименование = Наименование;
		ЕдиницаИзмеренияОбъект.НаименованиеПолное = Наименование;
		ЕдиницаИзмеренияОбъект.Записать();
		ЕдиницаИзмерения = ЕдиницаИзмеренияОбъект.Ссылка;
	КонецЕсли;
	
	Возврат ЕдиницаИзмерения;
	
КонецФункции

Функция ПолучитьЕдиницуИзмерения(Наименование, ЗначениеПоУмолчанию = Неопределено) Экспорт
	
	Если ЗначениеПоУмолчанию = Неопределено Тогда
		ЕдиницаИзмерения = Справочники.ЕдиницыИзмерения.ПустаяСсылка();
	Иначе
		ЕдиницаИзмерения = ЗначениеПоУмолчанию;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	ЕдиницыИзмерения.Ссылка
	|ИЗ
	|	Справочник.ЕдиницыИзмерения КАК ЕдиницыИзмерения
	|ГДЕ
	|	ЕдиницыИзмерения.Наименование ПОДОБНО &Наименование";
	
	Запрос.УстановитьПараметр("Наименование", Наименование);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Если Выборка.Следующий() Тогда
		ЕдиницаИзмерения = Выборка.Ссылка;
	КонецЕсли;
	
	Возврат ЕдиницаИзмерения;
	
КонецФункции

Функция ПолучитьГруппуТоваров(Наименование, ЗначениеПоУмолчанию = Неопределено) Экспорт
	
	Если ЗначениеПоУмолчанию = Неопределено Тогда
		Группа = Справочники.ЕдиницыИзмерения.ПустаяСсылка();
	Иначе
		Группа = ЗначениеПоУмолчанию;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	Номенклатура.Ссылка
	|ИЗ
	|	Справочник.Номенклатура КАК Номенклатура
	|ГДЕ
	|	Номенклатура.Наименование ПОДОБНО &Наименование
	|	И Номенклатура.ЭтоГруппа";
	
	Запрос.УстановитьПараметр("Наименование", Наименование);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Если Выборка.Следующий() Тогда
		Группа = Выборка.Ссылка;
	КонецЕсли;
	
	Возврат Группа;
	
КонецФункции

Функция ПолучитьВидАлкогольнойПродукцииПоКоду(КодАлкогольнойПродукции) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ВидыАлкогольнойПродукции.Ссылка КАК ВидыАлкогольнойПродукции
	|ИЗ
	|	Справочник.ВидыАлкогольнойПродукции КАК ВидыАлкогольнойПродукции
	|ГДЕ
	|	ВидыАлкогольнойПродукции.Код = &Код";
	
	Запрос.УстановитьПараметр("Код", КодАлкогольнойПродукции);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Если Выборка.Следующий() Тогда
		Возврат Выборка.ВидыАлкогольнойПродукции;
	КонецЕсли;
	
	Возврат Неопределено;
	
КонецФункции

#КонецОбласти
