&НаСервере
Процедура УдалитьДокументы() 
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	УГМК_ДокументФакт.Ссылка КАК Ссылка
	               |ИЗ
	               |	Документ.УГМК_ДокументФакт КАК УГМК_ДокументФакт
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	УГМК_ДокументФакт.Номер УБЫВ";
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	Выборка.Следующий(); //Пропускаем последний номер
	Пока Выборка.Следующий() Цикл
		ДокументОбъект = Выборка.Ссылка.ПолучитьОбъект();
		ДокументОбъект.ПометкаУдаления = Истина;
		ДокументОбъект.Записать();
	КонецЦикла;	// Вставить содержимое обработчика.
КонецПроцедуры


&НаКлиенте
Процедура ОчиститьДокументы(Команда)
	
	УдалитьДокументы();
	// Вставить содержимое обработчика.
КонецПроцедуры

&НаКлиенте
Процедура Выход(Команда)
	КодОтвета = Вопрос("Выйти из приложения?", РежимДиалогаВопрос.ДаНет, 10, КодВозвратаДиалога.Нет);
	Если КодОтвета = КодВозвратаДиалога.Да Тогда
		ЗавершитьРаботуСистемы();
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура ОтправитьДокументы(Команда)
	ОтправитьДокументыСервер();	
КонецПроцедуры


&НаСервере
Процедура ОтправитьДокументыСервер()
	Выборка = Документы.УГМК_ДокументФакт.Выбрать();
	Пока Выборка.Следующий() Цикл
		Обмен.ОтправитьДокумент(Выборка.Ссылка);	
	КонецЦикла;	
КонецПроцедуры

&НаКлиенте
Процедура ПроверитьПодключениеКВебСервису(Команда)
	ОткрытьФорму("ОбщаяФорма.АдресВебСервиса",,,,,,,РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);	
КонецПроцедуры


&НаКлиенте
Процедура УзлыОбмена(Команда)
	ОткрытьФорму("ПланОбмена.УГМК_ОбменСМобильнымиУстройствами.ФормаСписка");	
КонецПроцедуры


&НаСервереБезКонтекста
Процедура ОчисткаРегистраНастройкаРЦНаСервере()
	НаборЗаписей = РегистрыСведений.УГМК_НастройкиРабочихЦентров.СоздатьНаборЗаписей();
	НаборЗаписей.Прочитать();
	НаборЗаписей.Очистить();
	НаборЗаписей.Записать();
КонецПроцедуры


&НаКлиенте
Процедура ОчисткаРегистраНастройкаРЦ(Команда)
	ОчисткаРегистраНастройкаРЦНаСервере();
КонецПроцедуры



#Область ОбработчикиСобытийФормы


&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
		НастроитьФормуПоЗначениямНастроек();
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "ИзмененыЗначенияНастроек" ИЛИ ИмяСобытия = "ВыполненОбмен" Тогда
		
		НастроитьФормуПоЗначениямНастроек();
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура НастроитьФормуПоЗначениямНастроек()
	
	ОбщегоНазначения.УстановитьШрифт(ЭтаФорма);
	
КонецПроцедуры

&НаСервере
Процедура ВыгрузкаДанныхНаСервере()
	СформироватьПакетОбменаДляСервера();// Вставить содержимое обработчика.
КонецПроцедуры

Функция  СформироватьПакетОбменаДляСервера()
	ЗаписьХМЛ = Новый ЗаписьXML;
    ЗаписьХМЛ.УстановитьСтроку();
    Узел = ПланыОбмена.УГМК_ОбменСМобильнымиУстройствами.НайтиПоКоду("ЦБ");
    ЗаписьСообщения = ПланыОбмена.СоздатьЗаписьСообщения();
    ЗаписьСообщения.НачатьЗапись(ЗаписьХМЛ,Узел);
	ВыборкаИзменений = ПланыОбмена.ВыбратьИзменения(Узел,ЗаписьСообщения.НомерСообщения);
	Пока ВыборкаИзменений.Следующий() Цикл
		ОбОбмена = ВыборкаИзменений.Получить();
		//Если ТипЗнч(ОбОбмена) = Тип("РегистрСведенийНаборЗаписей.ОС_ПрисоединенныеФайлы") Тогда
		//	ОбОбмена.Отбор.МобильноеУстройство.Установить(Константы.ID.Получить());
		//	Для Каждого Запись Из ОбОбмена Цикл
		//		Запись.МобильноеУстройство = Константы.ID.Получить();
		//	КонецЦикла;
		//	ЗаписатьXML(ЗаписьХМЛ,ОбОбмена);
		//ИначеЕсли ТипЗнч(ОбОбмена) = Тип("ДокументОбъект.ПеремещениеТоваров") Тогда
		//	СформироватьОбъектДляОбмена(ЗаписьХМЛ, ОбОбмена);
		//ИначеЕсли ТипЗнч(ОбОбмена) = Тип("СправочникОбъект.Валюты") Тогда
		//	ЗаписатьXML(ЗаписьХМЛ,ОбОбмена);
		//КонецЕсли;
	КонецЦикла;

    ЗаписьСообщения.ЗакончитьЗапись();
    Возврат ЗаписьХМЛ.Закрыть();   
КонецФункции

&НаКлиенте
Процедура ВыгрузкаДанных(Команда)
	ВыгрузкаДанныхНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура СжатиеБазы(Команда)
	СжатиеБазыСервер();
КонецПроцедуры

&НаСервере
Процедура СжатиеБазыСервер()
	ВыборкаНоменклатуры = Справочники.Номенклатура.Выбрать();
	Пока ВыборкаНоменклатуры.Следующий() Цикл
		ОбъектНоменклатура = ВыборкаНоменклатуры.ПолучитьОбъект();
		Попытка 
			ОбъектНоменклатура.Удалить();
		Исключение
		КонецПопытки
	КонецЦикла;
КонецПроцедуры

#КонецОбласти
