Перем мНаборЗаписейРасценка Экспорт;


Процедура ПриЗаписи(Отказ)
	Если мНаборЗаписейРасценка.Количество() > 0 И
		 ЗначениеЗаполнено(мНаборЗаписейРасценка[0].Период) Тогда
		мНаборЗаписейРасценка[0].ТехнологическаяОперация = Ссылка.Владелец;
		мНаборЗаписейРасценка[0].ВариантТехнологическойОперации = Ссылка;
		//мНаборЗаписейРасценка[0].Расценка = Расценка;
		//мНаборЗаписейРасценка[0].НормаВремени = НормаВремени;
		//мНаборЗаписейРасценка[0].Период = ПериодРасценки;
		
		мНаборЗаписейРасценка.Отбор.ТехнологическаяОперация.Использование	= Истина;
		мНаборЗаписейРасценка.Отбор.ТехнологическаяОперация.Значение		= мНаборЗаписейРасценка[0].ТехнологическаяОперация;
		мНаборЗаписейРасценка.Отбор.ВариантТехнологическойОперации.Использование	= Истина;
		мНаборЗаписейРасценка.Отбор.ВариантТехнологическойОперации.Значение		= мНаборЗаписейРасценка[0].ВариантТехнологическойОперации;
		мНаборЗаписейРасценка.Отбор.Период.Использование	= Истина;
		мНаборЗаписейРасценка.Отбор.Период.Значение			= мНаборЗаписейРасценка[0].Период;
		мНаборЗаписейРасценка.Записать(Истина);
	КонецЕсли;
КонецПроцедуры


мНаборЗаписейРасценка	= РегистрыСведений.УГМК_РасценкиТехнологическихОпераций.СоздатьНаборЗаписей();
Запрос = Новый Запрос;
Запрос.УстановитьПараметр("ТехнологическаяОперация", Ссылка.Владелец);
Запрос.УстановитьПараметр("ВариантТехнологическойОперации", Ссылка);

Запрос.Текст =
"ВЫБРАТЬ
|	УГМК_РасценкиТехнологическихОперацийСрезПоследних.Период,
|	УГМК_РасценкиТехнологическихОперацийСрезПоследних.ТехнологическаяОперация,
|	УГМК_РасценкиТехнологическихОперацийСрезПоследних.ВариантТехнологическойОперации,
|	УГМК_РасценкиТехнологическихОперацийСрезПоследних.Расценка,
|	УГМК_РасценкиТехнологическихОперацийСрезПоследних.НормаВремени,
|	УГМК_РасценкиТехнологическихОперацийСрезПоследних.ЕдиницаИзмерения,
|	УГМК_РасценкиТехнологическихОперацийСрезПоследних.НормаВыработки
|ИЗ
|	РегистрСведений.УГМК_РасценкиТехнологическихОпераций.СрезПоследних(
|			,
|			&ТехнологическаяОперация = ТехнологическаяОперация
|				И &ВариантТехнологическойОперации = ВариантТехнологическойОперации) КАК УГМК_РасценкиТехнологическихОперацийСрезПоследних";
Выборка = Запрос.Выполнить().Выбрать();
Если Выборка.Следующий() Тогда
	ЗаполнитьЗначенияСвойств(мНаборЗаписейРасценка.Добавить(), Выборка);
КонецЕсли;

