
&НаКлиенте
Процедура СписокПередНачаломИзменения(Элемент, Отказ)
	// Вставить содержимое обработчика.
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	Пользователи.Ссылка КАК Ссылка,
	               |	Пользователи.ИдентификаторПользователяИБ КАК ИдентификаторПользователяИБ,
	               |	Пользователи.Наименование КАК Наименование,
	               |	Пользователи.ИдентификаторПользователяСервиса КАК ИдентификаторПользователяСервиса
	               |ИЗ
	               |	Справочник.Пользователи КАК Пользователи
	               |";
	РезультатЗапроса = Запрос.Выполнить();
	ТаблицаПользователей = РезультатЗапроса.Выгрузить();
	
КонецПроцедуры
