
Процедура ЗаполнитьПредопределенныйЭлемент(ТипОборудования, ИмяДрайвера, НаименованиеДрайвера, ИдентификаторОбъекта, ВерсияДрайвера = Неопределено, УстановкаИзМакета = Истина) Экспорт
	
	Попытка
		Драйвер = МенеджерОборудованияВызовСервера.ПредопределенныйЭлемент("Справочник.ДрайверыОборудования." + ИмяДрайвера);
	Исключение
		Сообщение = НСтр("ru = 'Предопределенный элемент ""%Параметр%"" не найден.'");
		Сообщение = СтрЗаменить(Сообщение, "%Параметр%", "Справочник.ДрайверыОборудования." + ИмяДрайвера);
		ВызватьИсключение Сообщение;
	КонецПопытки;
		
	Если Драйвер = Неопределено Тогда  
		Драйвер = Справочники.ДрайверыОборудования.СоздатьЭлемент();
		Драйвер.ИмяПредопределенныхДанных = ИмяДрайвера;     
	Иначе 
		Драйвер = Драйвер.ПолучитьОбъект();
	КонецЕсли;
	Драйвер.ТипОборудования      = ТипОборудования;
	Драйвер.Наименование         = НаименованиеДрайвера;
	Драйвер.ИдентификаторОбъекта = ИдентификаторОбъекта;
	Драйвер.ВерсияДрайвера       = ВерсияДрайвера;
	Драйвер.УстановкаИзМакета    = УстановкаИзМакета;
	Драйвер.Записать();
	
КонецПроцедуры
