
&НаКлиенте
Процедура ОткрытьОписьМеталла(Команда)
    ПараметрыФормы = Новый Структура;
    ПараметрыФормы.Вставить("ВидОперации", УГМК_МобильныйСерверВызовСервера.ПолучитьОписьМеталла());
	ОткрытьФорму("Документ.УГМК_ДокументФакт.ФормаСписка",ПараметрыФормы);	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьУниверсальныйБуфер(Команда)
    ПараметрыФормы = Новый Структура;
    ПараметрыФормы.Вставить("ВидОперации", УГМК_МобильныйСерверВызовСервера.ПолучитьУниверсальныйБуфер());
	ОткрытьФорму("Документ.УГМК_ДокументФакт.ФормаСписка",ПараметрыФормы);	
КонецПроцедуры

&НаКлиенте
Процедура Выход(Команда)
	КодОтвета = Вопрос("Выйти из приложения?", РежимДиалогаВопрос.ДаНет, 10, КодВозвратаДиалога.Нет);
	Если КодОтвета = КодВозвратаДиалога.Да Тогда
		ЗавершитьРаботуСистемы();
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьНавеска(Команда)
	ОткрытьФорму("Документ.УГМК_ДокументФакт.Форма.ФормаСпискаМобильнаяНавеска",,,,,,,РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);	
КонецПроцедуры

&НаКлиенте
Процедура УзлыОбмена(Команда)
	ОткрытьФорму("ПланОбмена.УГМК_ОбменСМобильнымиУстройствами.ФормаСписка");	
КонецПроцедуры

&НаКлиенте
Процедура ПолныйОбменСЦБ(Команда)
	Обмен.ВыполнитьСинхронизациюНаСервере();
	Обмен.ОтправитьДокументыСервер();
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьПодачаШихты(Команда)
	ОткрытьФорму("Документ.УГМК_ДокументФакт.Форма.ФормаСпискаМобильнаяПодачаШихты",,,,,,,РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);	
КонецПроцедуры


#Область ОбработчикиСобытийФормы


&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
		НастроитьФормуПоЗначениямНастроек();
		Элементы.Передел.Видимость = НЕ ПараметрыСеанса.ОграниченныйРежим; 
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "ИзмененыЗначенияНастроек" ИЛИ ИмяСобытия = "ВыполненОбмен" Тогда
		
		НастроитьФормуПоЗначениямНастроек();
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура НастроитьФормуПоЗначениямНастроек()
	
	ОбщегоНазначения.УстановитьШрифт(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьПередел(Команда)
    ПараметрыФормы = Новый Структура;
    ПараметрыФормы.Вставить("ВидОперации", УГМК_МобильныйСерверВызовСервера.ПолучитьПередел());
	ОткрытьФорму("Документ.УГМК_ДокументФакт.Форма.ФормаСпискаПередел",ПараметрыФормы);	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьИсторияПартии(Команда)
	ОткрытьФорму("ОбщаяФорма.ФормаИсторияПартии");	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьОсновноеМеню(Команда)
	ОткрытьФорму("ОбщаяФорма.РабочийСтол");	
КонецПроцедуры

&НаКлиенте
Процедура Настройки(Команда)
	ОткрытьФорму("ОбщаяФорма.РабочийСтол");	
КонецПроцедуры

&НаКлиенте
Процедура Принтеры(Команда)
	ОткрытьФорму("Справочник.УГМК_УстройстваПечати.ФормаСписка");
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьИнформацииПоБирке(Команда)
	ОткрытьФорму("ОбщаяФорма.ФормаИнформацияПоБирке");	
КонецПроцедуры

#КонецОбласти

