Процедура ОбновитьКлючПлавки() Экспорт
	КлючПлавки = Формат( НомерПечи, "ЧЦ=2; ЧН=00; ЧВН=")+"-"+Формат( НомерПлавки, "ЧЦ=3; ЧН=000; ЧВН=");
КонецПроцедуры
	
Процедура ПередЗаписью(Отказ)
	Если ОбменДанными.Загрузка  Тогда
		Возврат;
	КонецЕсли;
	
	//СтруктураОбязательныхПолей = Новый Структура("НомерПлавки");
	//
	//Заголовок = Строка( ЭтотОбъект);
	//
	//ЗаполнениеДокументов.ПроверитьЗаполнениеШапкиДокумента(ЭтотОбъект, СтруктураОбязательныхПолей, Отказ, Заголовок);
	
КонецПроцедуры

Функция ПолучитьСледующийНомерПлавки( ДляПечи, ТекСсылка) Экспорт
	Запр = Новый Запрос;
	Запр.УстановитьПараметр("НомерПечи", ДляПечи);
	Запр.УстановитьПараметр("Ссылка", ТекСсылка);
	Запр.Текст = "ВЫБРАТЬ
	             |	ЕстьNull( МАКСИМУМ(УГМК_Плавка.НомерПлавки), -1) КАК НомерПлавки
	             |ИЗ
	             |	БизнесПроцесс.УГМК_Плавка КАК УГМК_Плавка
	             |ГДЕ
	             |	УГМК_Плавка.НомерПечи = &НомерПечи
	             |	И УГМК_Плавка.Ссылка <> &Ссылка";
	Результат = Запр.Выполнить().Выбрать();
	СледующийНомер = 0;
	Если Результат.Следующий() тогда
		СледующийНомер = Результат.НомерПлавки+1;
		Если СледующийНомер = 1000 тогда
			СледующийНомер = 0;
		КонецЕсли;
	КонецЕсли;
	
	Возврат( СледующийНомер);
КонецФункции

Процедура ПриЗаписи(Отказ)
	Если ОбменДанными.Загрузка тогда
		Возврат;
	КонецЕсли;
	
КонецПроцедуры

Процедура ПереименоватьСерии() Экспорт
	Запр = Новый Запрос;
	Запр.УстановитьПараметр("Плавка", Ссылка);
	Запр.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
	             |	СерииНоменклатурыПлавки.Ссылка,
	             |	СерииНоменклатурыПлавки.Ссылка.Наименование
	             |ИЗ
	             |	Справочник.СерииНоменклатуры.УГМК_Плавки КАК СерииНоменклатурыПлавки
	             |ГДЕ
	             |	СерииНоменклатурыПлавки.Плавка = &Плавка";
	Результат = Запр.Выполнить().Выбрать();
	Пока Результат.Следующий() цикл
		Объект = Результат.Ссылка.ПолучитьОбъект();
		НовоеНаименование = УГМК_СлужебныеФункции.СформироватьНаименованиеПоПлавкам( Объект.УГМК_Плавки);
		Если Результат.Наименование <> НовоеНаименование тогда
			Объект.Наименование = НовоеНаименование;
			Объект.Записать();
			
			Сообщить("Обновлена серия "+Объект.Владелец+" ["+Объект.Код+"] "+Объект.Наименование);
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

Процедура ПроверитьПлавкуУСерии( СерияНоменклатуры, СсылкаБП) Экспорт
	Объект = СерияНоменклатуры.ПолучитьОбъект();
	СтрокаПлавки = Объект.УГМК_Плавки.Найти( СсылкаБП, "Плавка");
	Если СтрокаПлавки = Неопределено тогда
		Стр = Объект.Наименование;
		
		СтрокаПлавки = Объект.УГМК_Плавки.Добавить();
		СтрокаПлавки.Плавка = СсылкаБП;
		Объект.Наименование = УГМК_СлужебныеФункции.СформироватьНаименованиеПоПлавкам( Объект.УГМК_Плавки);
		Объект.Записать();
		
		Сообщить("Обновлена серия "+Объект.Владелец+" ["+Объект.Код+"] "+Объект.Наименование);
	КонецЕсли;
КонецПроцедуры

