
&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	//сообщить(ИмяСобытия);
	Если ИмяСобытия = "ИзменилосьКоличествоСтроки" Тогда
	ИначеЕсли ИмяСобытия = "ПродолжитьСканирование" Тогда
		СканированиеШтрихкода(Неопределено)	
	ИначеЕсли ИмяСобытия = "УведомлениеШК" Тогда
		ПолученныйШтрихкод = Параметр;
		Если ЗначениеЗаполнено(ПолученныйШтрихкод) Тогда
			СтрокаШтрихкода1 = СтрЗаменить( ПолученныйШтрихкод, "\", "");
			Объект.Адрес = ПолученныйШтрихкод;
			Объект.Наименование = СтрокаШтрихкода1;
		КонецЕсли;
	КонецЕсли;	
	//Вставить содержимое обработчика
КонецПроцедуры

&НаКлиенте
Процедура СканированиеШтрихкода(Команда)
	
	Если СканированиеКомпонентой1С Тогда
		СтартСканировать();
	Иначе	
		ИдетПроцессСканирования = Истина;
		ДополнительныеПараметры = Новый Структура;
		ДополнительныеПараметры.Вставить("Форма", ЭтаФорма);
		ДополнительныеПараметры.Вставить("ПотоковоеСканирование",Истина);
		ДополнительныеПараметры.Вставить("СканированиеУведомлением",Ложь);
		ПодключаемоеОборудованиеКлиент.ПолучитьШтрихкод(ДополнительныеПараметры);
	КонецЕсли;	
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	СканированиеКомпонентой1С = Константы.СканированиеКомпонентой1С.Получить();
	Элементы.ГруппаСканирование1С.Видимость = СканированиеКомпонентой1С;
	ПоУмолчанию = (УГМК_МобильныеУстройства.ПринтерПоУмолчанию() = Объект.Ссылка);
КонецПроцедуры

&НаКлиенте
Процедура СтартСканировать()
	#Если  МобильноеПриложениеКлиент  тогда
		Если НЕ СредстваМультимедиа.ПоддерживаетсяСканированиеШтрихКодов() Тогда
			Сообщить("не поддерживает сканирование штрихкода");
			Возврат;
		КонецЕсли; 	
	#КонецЕсли
	ОбработчикСканирования = Новый ОписаниеОповещения("ОбработкаСканирования", ЭтотОбъект);
	ОбработчикЗакрытия = Новый ОписаниеОповещения("ОбработкаЗакрытияИнтерфейса", ЭтотОбъект);
	#Если  МобильноеПриложениеКлиент  тогда
		СредстваМультимедиа.ПоказатьСканированиеШтрихКодов("Камеру на штрихкод", ОбработчикСканирования, ОбработчикЗакрытия,ТипШтрихКода.Двухмерный);
	#КонецЕсли
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаЗакрытияИнтерфейса(ДополнительныеПараметры) Экспорт
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаСканирования(Штрихкод, Результат, Сообщение, ДополнительныеПараметры) Экспорт
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	Если Результат Тогда
		СтрокаШтрихкода1 = СтрЗаменить( Штрихкод, "\", "");
		//СтрокаШтрихкода1 = СтрЗаменить( Штрихкод, Символы.ВК, "");
		//СтрокаШтрихкода1 = СтрЗаменить( СтрокаШтрихкода1, Символы.ПС, "");
		Объект.Адрес = Штрихкод;
		Объект.Наименование = СтрокаШтрихкода1;
		#Если МобильноеПриложениеКлиент Тогда
			СредстваМультимедиа.ЗакрытьСканированиеШтрихКодов();
		#КонецЕсли
	КонецЕсли;
КонецПроцедуры


&НаСервере
Процедура ПриЗаписиНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	Запрос = Новый Запрос;
	Запрос.Текст = "";
	ПринтерПоУмолчанию = УГМК_МобильныеУстройства.ПринтерПоУмолчанию();
	Если ПринтерПоУмолчанию = ТекущийОбъект.Ссылка Тогда
		Если НЕ ПоУмолчанию Тогда
			УГМК_МобильныеУстройства.ЗаписатьПринтерПоУмолчанию(ТекущийОбъект.Ссылка,,Истина);
		КонецЕсли;	
	Иначе
		Если ПоУмолчанию Тогда
			УГМК_МобильныеУстройства.ЗаписатьПринтерПоУмолчанию(ТекущийОбъект.Ссылка);
		КонецЕсли;		
	КонецЕсли;		
			
КонецПроцедуры

