
&НаКлиенте
Процедура ОК(Команда)
	ИзменитьКоличество = Истина;
	ПарметрыОповещения = Новый Структура;
	ПарметрыОповещения.Вставить("Группа", Группа);
	ПарметрыОповещения.Вставить("РаспечататьЭтикетку", РаспечататьЭтикетку);
	ПарметрыОповещения.Вставить("Количество", Количество);
	ПарметрыОповещения.Вставить("Количество1", Количество1);
	ПарметрыОповещения.Вставить("ИзменитьКоличество", Истина);
	ПарметрыОповещения.Вставить("Количество1Весовое", Количество1Весовое);
	#Если МобильноеПриложениеКлиент Тогда
		ДоставляемыеУведомления.ОтменитьЛокальныеУведомления();
	#КонецЕсли
	Оповестить("ИзменилосьКоличествоСтроки",ПарметрыОповещения);
	Закрыть();
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии()
	#Если МобильноеПриложениеКлиент Тогда
	ДоставляемыеУведомления.ОтменитьЛокальныеУведомления();
	#КонецЕсли
	Если ПродолжитьСканирование И (НЕ СканированиеУведомлением) Тогда
		Оповестить("ПродолжитьСканирование");
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ПродолжитьСканирование = Параметры.ПродолжитьСканирование;
	ВидОперации = Параметры.ВидОперации;
	ЕдиницаИзмерения1 = Параметры.ЕдиницаИзмерения1;
	Элементы.ГруппаУниверсальныйБуферКоличество.Видимость = Ложь;
	Элементы.ГруппаУниверсальныйБуферКоличествоУчетное.Видимость = Ложь;
	Элементы.ГруппаОписьМеталлаКоличество.Видимость = Ложь;
	Элементы.ГруппаОписьМеталлаКоличествоДоп.Видимость = Ложь;
	Элементы.КоличествоТара.Заголовок = "Тара (" + Параметры.Тара + ")";
	Если ВидОперации = УГМК_МобильныйСерверВызовСервера.ПолучитьУниверсальныйБуфер() Тогда
		Элементы.ГруппаУниверсальныйБуферКоличество.Видимость = Истина;
		Элементы.ГруппаУниверсальныйБуферКоличествоУчетное.Видимость = Истина;
	ИначеЕсли ВидОперации = УГМК_МобильныйСерверВызовСервера.ПолучитьОписьМеталла() Тогда
		Элементы.ГруппаОписьМеталлаКоличество.Видимость = Истина;
		Элементы.КнопкаВзяли.Заголовок = "Нетто" + ?(Параметры.Коэффициент1 > 0, "(+засор)","");
		Элементы.ГруппаОписьМеталлаКоличествоДоп.Видимость = Истина;
		Элементы.КнопкаОсталось.Заголовок = "Брутто";
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ПредставлениеПартии(ДанныеСтрокиПаспортПартии)
	СтрокаРезультат = "";
	Если ТипЗнч(ДанныеСтрокиПаспортПартии) = Тип("ДокументСсылка.УГМК_Регистратор") Тогда
		СтрокаРезультат = УГМК_МобильныйСервер.ПолучитьПолноеПредставлениеПартии(ДанныеСтрокиПаспортПартии.ПредставлениеИсточника,ДанныеСтрокиПаспортПартии.ТипИсточника);
	КонецЕсли;
	Возврат СтрокаРезультат;
КонецФункции


&НаКлиенте
Процедура ПриОткрытии(Отказ)
	#Если МобильноеПриложениеКлиент Тогда
	ДоставляемыеУведомления.ОтменитьЛокальныеУведомления();
	#КонецЕсли
	Элементы.ГруппаПродукции.Видимость = (Элементы.ГруппаПродукции.Видимость И ПоСвойствам);
	ПаспортПартии_МаркаСплава = Строка(ПредставлениеПартии(ПаспортПартии)) + " " + Строка(МаркаСплава);
	//ЭтаФорма.ТекущийЭлемент = Элементы.Количество;
КонецПроцедуры

&НаКлиенте
Процедура ВвестиЧислоКоличество(Команда)
	СтандартнаяОбработка = Ложь;
	ПараметрыВ = Новый Структура;
	ПараметрыВ.Вставить("Заголовок", "Количество");
	Результат = ОткрытьФормуМодально("Обработка.УГМК_ВводЧисла.Форма.ФормаМобильная",ПараметрыВ, ЭтаФорма);
	НовоеЗначение = Неопределено;
	Если Результат <> Неопределено тогда
		НовоеЗначение = Результат.Значение;
	КонецЕсли;
	Количество = НовоеЗначение;
КонецПроцедуры

&НаКлиенте
Процедура КомандаВзяли(Команда)
	СтандартнаяОбработка = Ложь;
	//НовоеЗначение = ВвестиЧисло(НовоеЗначение);
	
	ПараметрыВ = Новый Структура;
	ПараметрыВ.Вставить("Заголовок", "Количество");
	Результат = ОткрытьФормуМодально("Обработка.УГМК_ВводЧисла.Форма.ФормаМобильная",ПараметрыВ, ЭтаФорма);
	НовоеЗначение = Неопределено;
	Если Результат <> Неопределено тогда
		НовоеЗначение = Результат.Значение;
		КоличествоВзяли = НовоеЗначение;
		Если ЗначениеЗаполнено(Количество1) и УГМК_СлужебныеФункции.ВесоваяЕдиницаИзмерения(ЕдиницаИзмерения1) Тогда
			Количество1 = КоличествоВзяли;
			КоличествоОсталось = Количество1 + КоличествоТара;
			Если Коэффициент1 > 0 Тогда
				Количество = макс(0,Количество1-Количество1*(Коэффициент1/100));
			Иначе
				Количество = Количество1;
			КонецЕсли;
		Иначе
			Количество = КоличествоВзяли;
			КоличествоОсталось = Количество + КоличествоТара;
		КонецЕсли;	
		РаспечататьЭтикетку = Истина;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура КомандаОсталось(Команда)
	СтандартнаяОбработка = Ложь;
	ПараметрыВ = Новый Структура;
	ПараметрыВ.Вставить("Заголовок", "Количество доп");
	Результат = ОткрытьФормуМодально("Обработка.УГМК_ВводЧисла.Форма.ФормаМобильная",ПараметрыВ, ЭтаФорма);
	НовоеЗначение = Неопределено;
	Если Результат <> Неопределено тогда
		НовоеЗначение = Результат.Значение;
		КоличествоОсталось = НовоеЗначение;
		Если ЗначениеЗаполнено(Количество1) и УГМК_СлужебныеФункции.ВесоваяЕдиницаИзмерения(ЕдиницаИзмерения1) Тогда
			Количество1 = КоличествоОсталось - КоличествоТара;
			Если Коэффициент1 > 0 Тогда
				Количество = макс(0,Количество1-Количество1*(Коэффициент1/100));
			Иначе
				Количество = Количество1;
			КонецЕсли;	
			КоличествоВзяли = Количество1;
		Иначе
			Количество = КоличествоОсталось - КоличествоТара;
			КоличествоВзяли = Количество;
		КонецЕсли;	
		РаспечататьЭтикетку = Истина;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура КоличествоЧисло1ПриИзменении(Элемент)
	КомандаВзяли(Неопределено);
КонецПроцедуры

&НаКлиенте
Процедура КоличествоЧислоПриИзменении(Элемент)
	КомандаОсталось(Неопределено);
КонецПроцедуры

&НаКлиенте
Процедура КоличествоЧисло1НачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	КомандаВзяли(Неопределено);
КонецПроцедуры

&НаКлиенте
Процедура КоличествоЧислоНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	КомандаОсталось(Неопределено);
КонецПроцедуры

&НаКлиенте
Процедура КомандаУниверсальныйБуферОперационноеКоличество(Команда)
	СтандартнаяОбработка = Ложь;
	//НовоеЗначение = ВвестиЧисло(НовоеЗначение);
	
	ПараметрыВ = Новый Структура;
	ПараметрыВ.Вставить("Заголовок", "Количество");
	Результат = ОткрытьФормуМодально("Обработка.УГМК_ВводЧисла.Форма.ФормаМобильная",ПараметрыВ, ЭтаФорма);
	НовоеЗначение = Неопределено;
	Если Результат <> Неопределено тогда
		НовоеЗначение = Результат.Значение;
		Количество = НовоеЗначение;
		РаспечататьЭтикетку = Истина;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура КомандаУниверсальныйБуферУчетноеКоличество(Команда)
	// Вставить содержимое обработчика.
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьУниверсальныйБуфер() 
	возврат Справочники.УГМК_СостоянияЗаказа.Кооперация;
КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьОписьМеталла() 
	возврат Справочники.УГМК_СостоянияЗаказа.ОписьМеталла;
КонецФункции

&НаКлиенте
Процедура КоличествоЧислоОперационноеПриИзменении(Элемент)
	СтандартнаяОбработка = Ложь;
	КомандаУниверсальныйБуферОперационноеКоличество(Неопределено);
КонецПроцедуры

&НаКлиенте
Процедура КоличествоЧислоОперационноеНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	КомандаУниверсальныйБуферОперационноеКоличество(Неопределено);
КонецПроцедуры

&НаКлиенте
Процедура КоличествоВзялиКомандаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	КомандаВзяли(Неопределено);
КонецПроцедуры


&НаКлиенте
Процедура ТестОповещения(Команда)
	Оповестить("ИзменилосьКоличествоСтроки");
КонецПроцедуры


&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	Если ИмяСобытия = "УведомлениеШК" Тогда
		//сообщить(Параметр);
		ПолученныйШтрихкод = Параметр;
		Если ЗначениеЗаполнено(ПолученныйШтрихкод) Тогда
			СсылкаИзКода = УГМК_ОперативныйУчет.ВосстановитьСсылкуИзШтрихкода( ПолученныйШтрихкод);
			Если СсылкаИзКода <> Неопределено тогда
				ТипСодержимого = 1;
				ТипСсылки = ТипЗнч( СсылкаИзКода);
				Если ТипСсылки = Тип("СправочникСсылка.УГМК_Весы") тогда
					//получим вес
					КоличествоВес = УГМК_МобильныйСервер.КоличествоПолучитьСВесовНаСервере(СокрЛП(ПолученныйШтрихкод));
					Если ЗначениеЗаполнено(КоличествоВес) Тогда 
						
						КоличествоОсталось = КоличествоВес;
						Количество1 = КоличествоОсталось - КоличествоТара;
						Если Коэффициент1 > 0 Тогда
							Количество = макс(0,Количество1-Количество1*(Коэффициент1/100));
						Иначе
							Количество = Количество1;
						КонецЕсли;	
						КоличествоВзяли = Количество1;
						РаспечататьЭтикетку = Истина;
					КонецЕсли;	
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;	
КонецПроцедуры

