
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ТаблицаДокументов.Очистить();
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	УГМК_ДокументФактТест.Ссылка,
	               |	УГМК_ДокументФактТест.Номер,
	               |	УГМК_ДокументФактТест.Дата,
	               |	УГМК_ДокументФактТест.Склад
	               |ИЗ
	               |	Документ.УГМК_ДокументФактТест КАК УГМК_ДокументФактТест
	               |ГДЕ
	               |	НЕ УГМК_ДокументФактТест.ПометкаУдаления";
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса <> Неопределено Тогда
		ТаблицаЗапроса = РезультатЗапроса.Выгрузить();
		ТаблицаДокументов.Загрузить(ТаблицаЗапроса);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ИзменитьДокумент(Команда)
	  Элементы.ТаблицаДокументов.ТекущиеДанные.Ссылка.ПолучитьОбъект().ОтурытьФорму();
КонецПроцедуры


