
Процедура ПриУстановкеНовогоКода(СтандартнаяОбработка, Префикс)
 	ОбщегоНазначения.ДобавитьПрефиксУзла( Префикс);
КонецПроцедуры

Функция ИзмененСоставРабочихЦентров()
	Возврат( Истина);	
КонецФункции

Функция ПолучитьПодчиненныеОснастки( ОснасткаСсылка)
	Запр = Новый Запрос;
	Запр.УстановитьПараметр("РабочиеЦентрыПоОснастке",ОснасткаСсылка);
	Запр.Текст = "ВЫБРАТЬ
	             |	УГМК_ТехнологическаяОснастка.Ссылка
	             |ИЗ
	             |	Справочник.УГМК_ТехнологическаяОснастка КАК УГМК_ТехнологическаяОснастка
	             |ГДЕ
	             |	УГМК_ТехнологическаяОснастка.РабочиеЦентрыПоОснастке = &РабочиеЦентрыПоОснастке";
				 
	Возврат( Запр.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка"));
КонецФункции

Процедура ПриЗаписи(Отказ)
	
	Если (не ОбменДанными.Загрузка) и (не ЗначениеЗаполнено( ЭтотОбъект.РабочиеЦентрыПоОснастке)) и ИзмененСоставРабочихЦентров() тогда
		ПодчиненныеОснастки = ПолучитьПодчиненныеОснастки( ЭтотОбъект.Ссылка);
		
		НовыйСоставРЦ = ЭтотОбъект.РабочиеЦентры.Выгрузить();
		Для каждого Оснастка из ПодчиненныеОснастки цикл
			ОснасткаОбъект = Оснастка.ПолучитьОбъект();
			ОснасткаОбъект.РабочиеЦентры.Загрузить( НовыйСоставРЦ);
			ОснасткаОбъект.Записать();
			
			Сообщить("Обновлен элемент: "+Строка( ОснасткаОбъект)+" "+ОснасткаОбъект.ДляПоиска);
		КонецЦикла;
	КонецЕсли;
КонецПроцедуры
