

&НаКлиенте
Процедура Скопировать(Команда)
	ЭтаФорма.Закрыть();
КонецПроцедуры

&НаКлиенте
Процедура Удалить(Команда)
	ЭтаФорма.Закрыть();
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	СписокМеню.Вставить(0,0,"                 По таре
							|                (сорт-ка)");
	СписокМеню.Вставить(1,1,"          По марке сплава
							|                (сорт-ка)");
	СписокМеню.Вставить(2,2,"       По группе продукции
							|                (сорт-ка)");
	СписокМеню.Вставить(3,3,"                 Отмена");
	//СписокМеню.Вставить(4,4,"Кнопка5");
КонецПроцедуры

&НаКлиенте
Процедура СписокМенюПередНачаломИзменения(Элемент, Отказ)
	Отказ = Истина;
	//Закрыть();
КонецПроцедуры

&НаКлиенте
Процедура СписокМенюВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	Действие = ВыбраннаяСтрока;
	Закрыть();
КонецПроцедуры

