
#Область ПрограммныйИнтерфейс

Процедура ОпределитьПодключаемоеОборудование(Драйвер, ПодключаемоеОборудование) Экспорт
	
	ПодключаемоеОборудование = Справочники.ПодключаемоеОборудование.ПустаяСсылка();
	
	Если НЕ ЗначениеЗаполнено(Драйвер) Тогда
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	ПодключаемоеОборудование.Ссылка
	|ИЗ
	|	Справочник.ПодключаемоеОборудование КАК ПодключаемоеОборудование
	|ГДЕ
	|	ПодключаемоеОборудование.ДрайверОборудования = &ДрайверОборудования";
	
	Запрос.УстановитьПараметр("ДрайверОборудования", Драйвер);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Если Выборка.Следующий() Тогда
		
		ПодключаемоеОборудование = Выборка.Ссылка;
		
		Если НЕ ПодключаемоеОборудование.УстройствоИспользуется Тогда
			ПодключаемоеОборудованиеОбъект = ПодключаемоеОборудование.ПолучитьОбъект();
			ПодключаемоеОборудованиеОбъект.УстройствоИспользуется = Истина;
			ПодключаемоеОборудованиеОбъект.Записать();
		КонецЕсли;
		
	Иначе
		
		ПодключаемоеОборудованиеОбъект = Справочники.ПодключаемоеОборудование.СоздатьЭлемент();
		
		ПодключаемоеОборудованиеОбъект.ТипОборудования        = Драйвер.ТипОборудования;
		ПодключаемоеОборудованиеОбъект.ДрайверОборудования    = Драйвер;
		ПодключаемоеОборудованиеОбъект.Наименование           = Драйвер.Наименование;
		ПодключаемоеОборудованиеОбъект.УстройствоИспользуется = Истина;
		ПодключаемоеОборудованиеОбъект.Записать();
		
		ПодключаемоеОборудование = ПодключаемоеОборудованиеОбъект.Ссылка;
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
