Функция ПолучитьПрокси(ИмяПространстваИмен = "MobileTransferStr", ИмяВебСервиса = "MobileTransfer", ИмяТочкиПодключения = "MobileTransferSoap") Экспорт
	
	НаборКонстант = Константы.СоздатьНабор();
	НаборКонстант.Прочитать();
	ВСОпределение = Новый WSОпределения(НаборКонстант.АдресВебСервиса,НаборКонстант.ПользовательЦентральнойБазы,НаборКонстант.ПарольПользователя); 
	ВСервис = ВСОпределение.Сервисы.Получить(ИмяПространстваИмен,ИмяВебСервиса); 
	ВТочкаВхода = ВСервис.ТочкиПодключения.Получить(ИмяТочкиПодключения); 
	//ВОперация = ВТочкаВхода.Интерфейс.Операции.Получить("Get"); 
	ВСПрокси = Новый WSПрокси(ВСОпределение, ИмяПространстваИмен,ИмяВебСервиса,ИмяТочкиПодключения);
	ВСПрокси.Пользователь = НаборКонстант.ПользовательЦентральнойБазы; 
	ВСПрокси.Пароль = НаборКонстант.ПарольПользователя; 
	
	Возврат ВСПрокси;
	
КонецФункции

#Область СистемнаяИнформация
Функция ПолучитьСистемнуюИнформациюУстройства() Экспорт
	
		СтрИнфо = Новый Структура;
		МассивИнфы = Новый Массив;
		МассивИнфы.Добавить("ВерсияОС");
		МассивИнфы.Добавить("ВерсияПриложения");
		МассивИнфы.Добавить("ИдентификаторКлиента");
		МассивИнфы.Добавить("ИнформацияПрограммыПросмотра");
		МассивИнфы.Добавить("ОперативнаяПамять");
		МассивИнфы.Добавить("Процессор");
		МассивИнфы.Добавить("ТипПлатформы");
		
		Инфо = Новый СистемнаяИнформация;
		Для Каждого Стр Из МассивИнфы Цикл
			СтрИнфо.Вставить(Стр,Строка(Инфо[Стр]));
		КонецЦикла;
		СтрИнфо.Вставить("ИмяКомпьютера", ИмяКомпьютера()); 
		Возврат СтрИнфо;
КонецФункции
#КонецОбласти
