
Процедура ПередЗаписью(Отказ)
	Если ЭтоНовый() тогда
		Если Справочники.УГМК_НастройкиПользователей.Выбрать(,Владелец).Следующий() тогда
			Сообщить("Для владельца "+Владелец+" уже есть элемент настройки");
			Отказ=Истина;
		КонецЕсли;
	КонецЕсли;
	Наименование = Строка(Владелец);
	ТипВладельцаНастройки_ = Строка(ТипЗнч(Владелец));
	Поз = Найти(ТипВладельцаНастройки_,": ");
	Если Поз = 0 Тогда
		Поз = 1;
	Иначе
		Поз = Поз + 2;
	КонецЕсли; 
	ТипВладельцаНастройки = Сред(ТипВладельцаНастройки_, Поз);
	
КонецПроцедуры
