
&НаКлиенте
Процедура ИзменитьМаркуСплава(Команда)
	// Вставить содержимое обработчика.
		Результат = ОткрытьФормуМодально("ОбщаяФорма.ФормаВыборМаркиСплава"); 
		Если ЗначениеЗаполнено(Результат) Тогда
			Объект.Материалы[элементы.Материалы.ТекущаяСтрока].МаркаСплава = Результат.МаркаСплава;
			Объект.Материалы[элементы.Материалы.ТекущаяСтрока].Количество = 1111;
		КонецЕсли;
		//,Новый Структура("МаркаСплава",элементы.Материалы.ТекущиеДанные.МаркаСплава));
		//элементы.Материалы.ТекущиеДанные.МаркаСплава = Результат.МаркаСплава;
КонецПроцедуры

&НаКлиенте
Процедура МатериалыПриАктивизацииЯчейки(Элемент)
	
КонецПроцедуры

&НаКлиенте
Процедура МатериалыПередНачаломИзменения(Элемент, Отказ)
	Отказ =Истина;
КонецПроцедуры

&НаКлиенте
Процедура МатериалыПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	// Вставить содержимое обработчика.
КонецПроцедуры

&НаКлиенте
Процедура МатериалыПриАктивизацииСтроки(Элемент)
	// Вставить содержимое обработчика.
КонецПроцедуры

&НаКлиенте
Процедура МатериалыПриИзменении(Элемент)
	// Вставить содержимое обработчика.
КонецПроцедуры
