
&НаКлиенте
Процедура Авторизация(Команда)
	Если НЕ ЗначениеЗаполнено(НомерТелефона)
		И НЕ ЗначениеЗаполнено(Почта)
		И НЕ ЗначениеЗаполнено(КодСотрудника) Тогда
		Сообщить("Заполните хоть что-то!");
		Возврат;
	КонецЕсли;
	
	Попытка
		АвторизацияНаСервере();
		
	Исключение
		ОбработкаОшибок(ОписаниеОшибки());
	КонецПопытки;

КонецПроцедуры

&НаСервере
Процедура АвторизацияНаСервере()
	СтрЗапроса = Новый Структура;
	СтрЗапроса.Вставить("типРегистрации", "Новая регистрация");
	#Область СистемнаяИнформация
	СтрИнфо = Новый Структура;
	
	МассивИнфы = Новый Массив;
	МассивИнфы.Добавить("ВерсияОС");
	МассивИнфы.Добавить("ВерсияПриложения");
	МассивИнфы.Добавить("ИдентификаторКлиента");
	МассивИнфы.Добавить("ИнформацияПрограммыПросмотра");
	МассивИнфы.Добавить("ОперативнаяПамять");
	МассивИнфы.Добавить("Процессор");
	МассивИнфы.Добавить("ТипПлатформы");
	
	Инфо = Новый СистемнаяИнформация;
	Для Каждого Стр Из МассивИнфы Цикл
		СтрИнфо.Вставить(Стр,Строка(Инфо[Стр]));
	КонецЦикла;
	
	СтрЗапроса.Вставить("СистемнаяИнформация", СтрИнфо);
	#КонецОбласти
	
	#Область Авторизация
	СтрАвторизации = Новый Структура;
	СтрАвторизации.Вставить("НомерТелефона", НомерТелефона);
	СтрАвторизации.Вставить("Почта", Почта);
	СтрАвторизации.Вставить("КодСотрудника", КодСотрудника);
	
	СтрЗапроса.Вставить("АвторизационныеДанные", СтрАвторизации);
	#КонецОбласти
	
	СтрЗапроса.Вставить("ИнформацияОКонфигурации", ПолучитьИнфуОКонфигурации());
	
	Ответ = ПодключениеКВебСервисуЦентральнойБД(СтрЗапроса, ДополнительныеФункцииСервер.СтандартныеНастройкиПодключения());
	Если ОбработкаОшибок(Ответ.Ошибка) тогда Возврат КонецЕсли;
	Константы.ID.Установить(СтрЗапроса.ИнформацияОКонфигурации.ID);
	УправлениеВидимостью(2);
КонецПроцедуры

&НаКлиенте
Процедура Активировать(Команда)
	Попытка
		АктивироватьНаСервере();
		
	Исключение
		ОбработкаОшибок(ОписаниеОшибки());
	КонецПопытки;
КонецПроцедуры

&НаСервере
Процедура АктивироватьНаСервере()
	СтрЗапроса = Новый Структура;
	СтрЗапроса.Вставить("типРегистрации", "Подтверждение регистрации");
	СтрЗапроса.Вставить("КодПодтверждения", ПрисланныйКод);
	СтрЗапроса.Вставить("ИнформацияОКонфигурации", ПолучитьИнфуОКонфигурации());
	Ответ = ПодключениеКВебСервисуЦентральнойБД(СтрЗапроса,ДополнительныеФункцииСервер.СтандартныеНастройкиПодключения());
	Если ОбработкаОшибок(Ответ.Ошибка) тогда Возврат КонецЕсли;
	Ответ.СтруктураСоединенияСЦентральнойБазой.Вставить("УспешнаяПроверка", Ложь);
	Константы.НастройкиПодключения.Установить(Новый ХранилищеЗначения(Ответ.СтруктураСоединенияСЦентральнойБазой));
	
	ЭтотУзел = ПланыОбмена.ОС_ОбменСМобильнымиУстройствами.ЭтотУзел();
	ОбУзла = ЭтотУзел.ПолучитьОбъект();
	ОбУзла.Код = Ответ.ДанныеДляНастройкиОбмена.КодУзлаМобУстр;
	ОбУзла.Наименование = Константы.ID.Получить();
	ОбУзла.Записать();
	
	Попытка
		ГлУзел = Ответ.ДанныеДляНастройкиОбмена.УзелГлавнойБазы;
		ГлУзел.Записать();	
	Исключение
		Об = ПланыОбмена.УГМК_ОбменСМобильнымиУстройствами.СоздатьУзел();
		Об.Код = "ЦБ";
		Об.Наименование = "Центральная база данных";
		Об.Записать();		
	КонецПопытки;
	
	УправлениеВидимостью(3);
КонецПроцедуры

&НаКлиенте
Процедура ПроверитьСоединение(Команда)
	Попытка
		ПроверитьСоединениеНаСервере();
	Исключение
		ОбработкаОшибок(ОписаниеОшибки());
	КонецПопытки;
КонецПроцедуры

&НаСервере
Процедура ПроверитьСоединениеНаСервере()
	СтрЗапроса = Новый Структура;
	СтрЗапроса.Вставить("типРегистрации", "Проверка соединения");
	СтрЗапроса.Вставить("ИнформацияОКонфигурации", ПолучитьИнфуОКонфигурации());
	
	СтруктураПодключения = Константы.НастройкиПодключения.Получить().Получить();
	СтруктураПодключения.ИмяФункции = "Registration";
	
	Ответ = ПодключениеКВебСервисуЦентральнойБД(СтрЗапроса,СтруктураПодключения);
	
	Если ОбработкаОшибок(Ответ.Ошибка) тогда Возврат КонецЕсли;
	Элементы.НадписьИнформацияОСоединении.Заголовок = Ответ.Информация;
	СтруктураПодключения = Константы.НастройкиПодключения.Получить().Получить();
	СтруктураПодключения.УспешнаяПроверка = Истина;
	Константы.НастройкиПодключения.Установить(Новый ХранилищеЗначения(СтруктураПодключения));
КонецПроцедуры

&НаСервере
Процедура УправлениеВидимостью(Шаг)
	Элементы.ГруппаАвторизации.Видимость = Шаг = 1;
	Элементы.ГруппаВводаКапчи.Видимость = Шаг = 2;
	Элементы.ГруппаПроверкиСоединения.Видимость = Шаг = 3;
	КоманднаяПанель.ПодчиненныеЭлементы.ФормаПредыдущийЭтап.Доступность = Шаг - 1;
	ЭтапАвторизации = Шаг;
КонецПроцедуры

&НаКлиенте
Процедура ПочтаПриИзменении(Элемент)
	ПочтаПравильная = Найти(Почта,".") И Найти(Почта,"@") И НЕ Найти(Почта," ") И НЕ Найти(Почта,",");

	Элементы.ПочтаУказанаВерно.Видимость = ПочтаПравильная;
	Элементы.ПочтаУказанаНеВерно.Видимость = Не ПочтаПравильная;
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	УправлениеВидимостью(Параметры.Этап)
КонецПроцедуры

&НаКлиенте
Процедура ПредыдущийЭтап(Команда)
	УправлениеВидимостью(ЭтапАвторизации - 1)
КонецПроцедуры
