Функция  ЗапросВыпуска(ВводСквозногоНомера,Дата,Подразделение) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("СквознойНомер", ВводСквозногоНомера);	
	Запрос.УстановитьПараметр("ДатаКон", Дата);	
	Запрос.УстановитьПараметр("Подразделение", Подразделение);	
	
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	МатериалыВПроизводствеОстатки.Подразделение КАК Подразделение,
	               |	МатериалыВПроизводствеОстатки.Заказ КАК ЗаказПокупателя,
	               |	МатериалыВПроизводствеОстатки.Заказ.Контрагент КАК Контрагент,
	               |	МатериалыВПроизводствеОстатки.ХарактеристикаЗатраты КАК Характеристика,
	               |	МатериалыВПроизводствеОстатки.СерияЗатраты КАК Серия,
	               |	МатериалыВПроизводствеОстатки.КоличествоОстаток КАК Количество,
	               |	МатериалыВПроизводствеОстатки.Затрата КАК Номенклатура,
	               |	ВложенныйЗапрос.tb_НоменклатураID КАК СквознойНомер
	               |ИЗ
	               |	РегистрНакопления.МатериалыВПроизводстве.Остатки(&ДатаКон, Подразделение = &Подразделение) КАК МатериалыВПроизводствеОстатки
	               |		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	               |			ЗаказПокупателяТовары.Ссылка КАК ЗаказПокупателя,
	               |			ЗаказПокупателяТовары.Номенклатура КАК Номенклатура,
	               |			ЗаказПокупателяТовары.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
	               |			ЗаказПокупателяТовары.tb_НоменклатураID КАК tb_НоменклатураID
	               |		ИЗ
	               |			Документ.ЗаказПокупателя.Товары КАК ЗаказПокупателяТовары
	               |		ГДЕ
	               |			ЗаказПокупателяТовары.Ссылка.ПометкаУдаления = ЛОЖЬ
	               |		
	               |		ОБЪЕДИНИТЬ ВСЕ
	               |		
	               |		ВЫБРАТЬ
	               |			КорректировкаЗаказаПокупателяТовары.Ссылка.ЗаказПокупателя,
	               |			КорректировкаЗаказаПокупателяТовары.Номенклатура,
	               |			КорректировкаЗаказаПокупателяТовары.ХарактеристикаНоменклатуры,
	               |			КорректировкаЗаказаПокупателяТовары.tb_НоменклатураID
	               |		ИЗ
	               |			Документ.КорректировкаЗаказаПокупателя.Товары КАК КорректировкаЗаказаПокупателяТовары
	               |		ГДЕ
	               |			КорректировкаЗаказаПокупателяТовары.Ссылка.ПометкаУдаления = ЛОЖЬ) КАК ВложенныйЗапрос
	               |		ПО МатериалыВПроизводствеОстатки.Заказ = ВложенныйЗапрос.ЗаказПокупателя
	               |			И МатериалыВПроизводствеОстатки.Затрата = ВложенныйЗапрос.Номенклатура
	               |			И МатериалыВПроизводствеОстатки.ХарактеристикаЗатраты = ВложенныйЗапрос.ХарактеристикаНоменклатуры
	               |ГДЕ
	               |	МатериалыВПроизводствеОстатки.Заказ ССЫЛКА Документ.ЗаказПокупателя
	               |	И ВложенныйЗапрос.tb_НоменклатураID = &СквознойНомер
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	Контрагент,
	               |	ЗаказПокупателя
	               |АВТОУПОРЯДОЧИВАНИЕ";	
	
	Возврат (Запрос.Выполнить().Выгрузить());
	
КонецФункции	
