
Процедура ПередЗаписью(Отказ, Замещение)
	Для каждого Запись из ЭтотОбъект цикл
		Если (не ЗначениеЗаполнено( Запись.Заказ)) и (Запись.Заказ <> Неопределено) тогда
			Запись.Заказ = Неопределено;
		КонецЕсли;
		Если (не ЗначениеЗаполнено( Запись.ЗаказВыпуска)) и (Запись.ЗаказВыпуска <> Неопределено) тогда
			Запись.ЗаказВыпуска = Неопределено;
		КонецЕсли;
		Если (не ЗначениеЗаполнено( Запись.ТочкаМаршрута)) и (Запись.ТочкаМаршрута <> Неопределено) тогда
			Запись.ТочкаМаршрута = Неопределено;
		КонецЕсли;
		Если (не ЗначениеЗаполнено( Запись.Номенклатура)) и (Запись.Номенклатура <> Неопределено) тогда
			Запись.Номенклатура = Неопределено;
		КонецЕсли;
		Если (не ЗначениеЗаполнено( Запись.ХарактеристикаНоменклатуры)) и (Запись.ХарактеристикаНоменклатуры <> Неопределено) тогда
			Запись.ХарактеристикаНоменклатуры = Неопределено;
		КонецЕсли;
		Если (не ЗначениеЗаполнено( Запись.СерияНоменклатуры)) и (Запись.СерияНоменклатуры <> Неопределено) тогда
			Запись.СерияНоменклатуры = Неопределено;
		КонецЕсли;
		Если (не ЗначениеЗаполнено( Запись.ПаспортПартии)) и (Запись.ПаспортПартии <> Неопределено) тогда
			Запись.ПаспортПартии = Неопределено;
		КонецЕсли;
	КонецЦикла
КонецПроцедуры
