
#Область ПрограммныйИнтерфейс

// Возвращает числовое значение ставки НДС по значению перечисления
//
// Параметры:
// 		СтавкаНДС - ПеречислениеСсылка.СтавкиНДС - значение перечисления СтавкиНДС.
//
// Возвращаемое значение:
// 		Число - Значение ставки НДС числом.
//
Функция ПолучитьСтавкуНДСЧислом(Знач СтавкаНДС) Экспорт
	
	Если СтавкаНДС = ПредопределенноеЗначение("Перечисление.СтавкиНДС.НДС10") Тогда
		Возврат 0.1;
	ИначеЕсли СтавкаНДС = ПредопределенноеЗначение("Перечисление.СтавкиНДС.НДС18") Тогда
		Возврат 0.18;
	Иначе
		Возврат 0;
	КонецЕсли;
	
КонецФункции

// Возвращает числовое значение ставки НДС по значению перечисления
//
// Параметры:
// 		СтавкаНДС - ПеречислениеСсылка.СтавкиНДС - значение перечисления СтавкиНДС.
//
// Возвращаемое значение:
// 		Число - Значение ставки НДС числом.
//
Функция ПолучитьСтавкуНДСЦелымЧислом(Знач СтавкаНДС) Экспорт
	
	Если СтавкаНДС = ПредопределенноеЗначение("Перечисление.СтавкиНДС.НДС10") Тогда
		Возврат 10;
	ИначеЕсли СтавкаНДС = ПредопределенноеЗначение("Перечисление.СтавкиНДС.НДС18") Тогда
		Возврат 18;
	Иначе
		Возврат 0;
	КонецЕсли;
КонецФункции

// Возвращает значение перечисления ставки НДС по числовому значению
//
//  Параметры:
//  Число - Значение ставки НДС числом.
//
//  Возвращаемое значение:
//  СтавкаНДС - ПеречислениеСсылка.СтавкиНДС - значение перечисления СтавкиНДС.
//
Функция ПолучитьСтавкуНДС(Знач СтавкаНДСЧислом, ЗначениеПоУмолчанию = Неопределено) Экспорт
	
	Если СтавкаНДСЧислом = 18 Тогда
		Возврат ПредопределенноеЗначение("Перечисление.СтавкиНДС.НДС18");
	ИначеЕсли СтавкаНДСЧислом = 10 Тогда
		Возврат ПредопределенноеЗначение("Перечисление.СтавкиНДС.НДС10");
	ИначеЕсли СтавкаНДСЧислом = 0 Тогда
		Возврат ПредопределенноеЗначение("Перечисление.СтавкиНДС.БезНДС");
	Иначе
		Если ЗначениеПоУмолчанию = Неопределено Тогда
			Возврат ПредопределенноеЗначение("Перечисление.СтавкиНДС.НДС18");
		Иначе
			Возврат ЗначениеПоУмолчанию;
		КонецЕсли;
	КонецЕсли;
КонецФункции

#КонецОбласти
