
Функция Синхронизация(Данные)
	ОтветКлиенту = ЗарегестрироватьВыгрузку(Данные.Получить());
	Возврат Новый ХранилищеЗначения(ОтветКлиенту, Новый СжатиеДанных(9));
КонецФункции

Функция ЗарегестрироватьВыгрузку(СтрокаСообщения)
	ЧтениеХМЛ = Новый ЧтениеXML;
    ЧтениеХМЛ.УстановитьСтроку(СтрокаСообщения);
    
    ЧтениеСообщения = ПланыОбмена.СоздатьЧтениеСообщения();
    ЧтениеСообщения.НачатьЧтение(ЧтениеХМЛ);
	Узел = ЧтениеСообщения.Отправитель;
	
	Пока ВозможностьЧтенияXML(ЧтениеХМЛ) Цикл
		Данные = ПрочитатьXML(ЧтениеСообщения.ЧтениеXML);
		
		Если Не Данные = Неопределено Тогда
			Если ТипЗнч(Данные) = Тип("ДокументОбъект.СписаниеДенежныхСредств") Тогда
				Если Данные.Сумма < 100 Тогда Продолжить КонецЕсли; 
			КонецЕсли; 
		
			Данные.ОбменДанными.Отправитель = Узел;
			Данные.ОбменДанными.Загрузка = Истина;
			
			Данные.Записать();
			
		КонецЕсли;
	КонецЦикла;

    ЧтениеСообщения.ЗакончитьЧтение();  
	
    ЗаписьХМЛ = Новый ЗаписьXML;
    ЗаписьХМЛ.УстановитьСтроку();
	ЗаписьСообщения = ПланыОбмена.СоздатьЗаписьСообщения();
	
	ЗаписьСообщения.НачатьЗапись(ЗаписьХМЛ,Узел);
	ВыборкаИзменений = ПланыОбмена.ВыбратьИзменения(Узел,ЗаписьСообщения.НомерСообщения);
	Пока ВыборкаИзменений.Следующий() Цикл
		ОбъектОбмена = ВыборкаИзменений.Получить();
		ЗаписатьXML(ЗаписьХМЛ,ОбъектОбмена);		
	КонецЦикла; 
	
	ЗаписьСообщения.ЗакончитьЗапись();

    Возврат ЗаписьХМЛ.Закрыть(); 
КонецФункции
