Процедура ПроверитьТипыВведенныхДанных( СтрОш, Запись)
	ТипЗ = ТипЗнч( Запись.ЗначениеНастроки);
	Если Запись.ДополнениеИмени = "" или Запись.ДополнениеИмени = "Продукции" тогда
		Если ТипЗ <> Тип("СправочникСсылка.СК_ГруппыПродукции") тогда
			СтрОш = СтрОш + "Настройка ["+Запись.ДополнениеИмени+"] тип "+ТипЗ+" ожидается СправочникСсылка.СК_ГруппыПродукции";
		КонецЕсли;
	иначеЕсли Запись.ДополнениеИмени = "Операции" тогда
		Если ТипЗ <> Тип("СправочникСсылка.УГМК_СостоянияЗаказа") тогда
			СтрОш = СтрОш + "Настройка ["+Запись.ДополнениеИмени+"] тип "+ТипЗ+" ожидается СправочникСсылка.УГМК_СостоянияЗаказа";
		КонецЕсли;		
	иначеЕсли Запись.ДополнениеИмени = "РабочиеЦентры" тогда
		Если не (ТипЗ = Тип("СправочникСсылка.РабочиеЦентры") или ТипЗ = Тип("СправочникСсылка.ГруппыЗаменяемостиРабочихЦентров")) тогда
			СтрОш = СтрОш + "Настройка ["+Запись.ДополнениеИмени+"] тип "+ТипЗ+" ожидается СправочникСсылка.РабочиеЦентры или СправочникСсылка.ГруппыЗаменяемостиРабочихЦентров";
		КонецЕсли;		
	иначеЕсли Запись.ДополнениеИмени = "Режимы" тогда
		Если ТипЗ <> Тип("СправочникСсылка.УГМК_РежимыРаботыРабочихЦентров") тогда
			СтрОш = СтрОш + "Настройка ["+Запись.ДополнениеИмени+"] тип "+ТипЗ+" ожидается СправочникСсылка.УГМК_РежимыРаботыРабочихЦентров";
		КонецЕсли;		
	иначеЕсли Запись.ДополнениеИмени = "ТипПартии" или Запись.ДополнениеИмени = "ТипПартииПродукции" тогда
		Если ТипЗ <> Тип("Строка") тогда
			СтрОш = СтрОш + "Настройка ["+Запись.ДополнениеИмени+"] тип "+ТипЗ+" ожидается Строка";
		КонецЕсли;
	иначеЕсли Запись.ДополнениеИмени = "МаскаВвода.УГМК_ПаспортПартии" или Запись.ДополнениеИмени = "МаскаВвода.УГМК_Плавка" или Запись.ДополнениеИмени = "МаскаВвода.УГМК_ПартияСырья" тогда
		Если ТипЗ <> Тип("Строка") тогда
			СтрОш = СтрОш + "Настройка ["+Запись.ДополнениеИмени+"] тип "+ТипЗ+" ожидается Строка";
		КонецЕсли;
	иначеЕсли Запись.ДополнениеИмени = "ДопускаетИзменениеПартии" тогда
		Если ТипЗ <> Тип("Булево") тогда
			СтрОш = СтрОш + "Настройка ["+Запись.ДополнениеИмени+"] тип "+ТипЗ+" ожидается Булево";
		КонецЕсли;		
	иначеЕсли Запись.ДополнениеИмени = "Подразделения" тогда
		Если ТипЗ <> Тип("СправочникСсылка.Подразделения") тогда
			СтрОш = СтрОш + "Настройка ["+Запись.ДополнениеИмени+"] тип "+ТипЗ+" ожидается СправочникСсылка.Подразделения";
		КонецЕсли;		
	иначеЕсли Запись.ДополнениеИмени = "Склады" тогда
		Если ТипЗ <> Тип("СправочникСсылка.Склады") тогда
			СтрОш = СтрОш + "Настройка ["+Запись.ДополнениеИмени+"] тип "+ТипЗ+" ожидается СправочникСсылка.Склады";
		КонецЕсли;		
	иначеЕсли Запись.ДополнениеИмени = "Пользователи" тогда
		Если ТипЗ <> Тип("СправочникСсылка.Пользователи") тогда
			СтрОш = СтрОш + "Настройка ["+Запись.ДополнениеИмени+"] тип "+ТипЗ+" ожидается СправочникСсылка.Пользователи";
		КонецЕсли;		
	иначеЕсли Запись.ДополнениеИмени = "Водители" тогда
		Если ТипЗ <> Тип("СправочникСсылка.СотрудникиОрганизаций") тогда
			СтрОш = СтрОш + "Настройка ["+Запись.ДополнениеИмени+"] тип "+ТипЗ+" ожидается СправочникСсылка.СотрудникиОрганизаций";
		КонецЕсли;
	иначеЕсли (Запись.ДополнениеИмени = "ВыборПодразделенияВПеремещении") или
		      (Запись.ДополнениеИмени = "УГМК_Плавка") или
		      (Запись.ДополнениеИмени = "УГМК_ПартияСырья") или
		      (Запись.ДополнениеИмени = "УГМК_ПаспортПартии") или
		      (Запись.ДополнениеИмени = "УГМК_ПаспортПартииСТК") тогда
		Если ТипЗ <> Тип("Булево") тогда
			СтрОш = СтрОш + "Настройка ["+Запись.ДополнениеИмени+"] тип "+ТипЗ+" ожидается Булево";
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

Процедура ПередЗаписью(Отказ, Замещение)
	СтрОш = "";
	Для каждого Запись из ЭтотОбъект цикл
		ПроверитьТипыВведенныхДанных( СтрОш, Запись);
	КонецЦикла;
	
	Если не ПустаяСтрока( СтрОш) тогда
		#Если  МобильноеПриложениеКлиент  тогда
			Сообщить(СтрОш);
		#КонецЕсли 	
	КонецЕсли;
КонецПроцедуры
