&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	КОЛИЧЕСТВО(ДрайверыОборудования.Ссылка) КАК КоличествоДрайверов
		|ИЗ
		|	Справочник.ДрайверыОборудования КАК ДрайверыОборудования";
	
	РезультатЗапроса = Запрос.Выполнить();
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	Если ВыборкаДетальныеЗаписи.Следующий() И ВыборкаДетальныеЗаписи.КоличествоДрайверов = 0 Тогда
		МенеджерОборудованияВызовСервераПереопределяемый.ОбновитьПоставляемыеДрайвера();
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ОткрытьДемоТестированиеОборудования(Команда)
	
	ОткрытьФорму("Обработка.ДемоТестированиеОборудования.Форма.Форма",, ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьДрайверыОборудования(Команда)
	
	ОткрытьФорму("Справочник.ДрайверыОборудования.ФормаСписка",, ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьПодключаемоеОборудование(Команда)
	
	ОткрытьФорму("Справочник.ПодключаемоеОборудование.ФормаСписка",, ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьПоставляемыеДрайвера(Команда)
	
	МенеджерОборудованияВызовСервераПереопределяемый.ОбновитьПоставляемыеДрайвера();
	
КонецПроцедуры      