// Соединяется с web-сервисом центральной базы
Функция ПолучитьПрокси() Экспорт
	
	
	Пользователь = СокрЛП(Константы.ПользовательЦентральнойБазы.Получить());
	Пароль = Константы.ПарольПользователя.Получить();
    URI = "MobileTransferStr";
	Адрес = СокрЛП(Константы.АдресЦентральнойБазы.Получить());
    Если Адрес = "" Тогда
        Возврат Ложь;
    КонецЕсли;
		
	Попытка
		Попытка
			АдресСервиса = Адрес + "/ws/MobileTransfer" + "?wsdl";
			Определения = Новый WSОпределения(АдресСервиса,Пользователь,Пароль,,300);
		Исключение
			АдресСервиса = Адрес + "/ws/MobileTransfer" + ".1cws?wsdl";
			Определения = Новый WSОпределения(АдресСервиса,Пользователь,Пароль,,300);
		КонецПопытки;
	Исключение		
		Инфо = ИнформацияОбОшибке();
		//Если ЗначениеЗаполнено(Константы.ДатаПоследнегоОбновления.Получить()) Тогда
		//	ТекстОшибки = РаботаСоСтроками.ПодставитьПараметрыВСтроку(
		//		НСтр("ru = 'Не удалось подключиться.
		//			|Вероятно, не работает интернет-соединение.
		//			|<b>Повторите попытку.</b>
		//			|
		//			|#Текст ошибки (для администратора):#
		//			|%1'"),
		//		ПодробноеПредставлениеОшибки(Инфо));
		//Иначе
			ТекстОшибки = РаботаСоСтроками.ПодставитьПараметрыВСтроку(
				НСтр("ru = 'Не удалось подключиться.
					|1.Уточните у администратора, что на сервере включено использование мобильных клиентов.
					|2.Убедитесь, что правильно ввели адрес, логин и пароль.
					|3.Уточните у администратора наличие доступа к документообороту через web.
					|4.Проверьте, что работает интернет-соединение.
					|
					|#Текст ошибки (для администратора):#
					|%1'"),
				ПодробноеПредставлениеОшибки(Инфо));
		//КонецЕсли;
		//МоментВремени = РегистрыСведений.ПротоколСобытий.ДобавитьОшибку(ТекстОшибки);
		ВызватьИсключение (ТекстОшибки);
	КонецПопытки;
	Константы.АдресВебСервиса.Установить(АдресСервиса);	
	Прокси = Новый WSПрокси(
		Определения, 
		URI, 
		"MobileTransfer", 
		"MobileTransferSoap",, 300);	
	Прокси.Пользователь = Пользователь;
	Прокси.Пароль = Пароль;		
	
	РегистрыСведений.ПротоколСобытий.ДобавитьИнформацию(НСтр("ru = 'Прокси получен'"));
	
	ДанныеОПрокси = Новый Структура;
	ДанныеОПрокси.Вставить("Прокси", Прокси);
	//ДанныеОПрокси.Вставить("ВерсияСервиса", НомерВерсииСервиса);
	Возврат ДанныеОПрокси;
	
КонецФункции

