Функция ПредставлениеСтрокиКлиентКратко(ДанныеСтрокиЗапись) Экспорт
	СтрокаПредставление = "";
	Если ДанныеСтрокиЗапись.ПоСвойствам Тогда 
		 //Строка(ДанныеСтрокиЗапись.МаркаСплава) + " ; " + 
					СтрокаПредставление =  Строка(ДанныеСтрокиЗапись.Количество1+ДанныеСтрокиЗапись.КоличествоТара) + " ; "
												+ Строка(ДанныеСтрокиЗапись.ГруппаПродукции) + " ; "
												+ Строка(ДанныеСтрокиЗапись.ХарактеристикаНоменклатуры) + " ; "
												+ ?(ЗначениеЗаполнено(ДанныеСтрокиЗапись.СерияНоменклатуры),Строка(ДанныеСтрокиЗапись.СерияНоменклатуры),ДанныеСтрокиЗапись.СерияНоменклатурыПредставление) + " ; "
												+ Строка(ДанныеСтрокиЗапись.Тара) + " ; "
												//+ ПредставлениеПартии(ДанныеСтрокиЗапись.ПаспортПартии) + " ; "
												//+ Строка(ДанныеСтрокиЗапись.Коэффициент) + " ; "
												//+ Строка(ДанныеСтрокиЗапись.Количество) + " ; "
												//+ Строка(ДанныеСтрокиЗапись.Количество1) + " ; "
												+ Строка(ДанныеСтрокиЗапись.КоличествоМест) + " ; ";
												//+ Строка(ДанныеСтрокиЗапись.Маркировка);
																	
		
	Иначе	
							СтрокаПредставление = Строка(ДанныеСтрокиЗапись.Количество1+ДанныеСтрокиЗапись.КоличествоТара) + " ; "
												+ Строка(ДанныеСтрокиЗапись.ГруппаПродукции) + " ; "
												+ Строка(ДанныеСтрокиЗапись.Номенклатура) + " ; "
												+ Строка(ДанныеСтрокиЗапись.ХарактеристикаНоменклатуры) + " ; "
												+ ?(ЗначениеЗаполнено(ДанныеСтрокиЗапись.СерияНоменклатуры),Строка(ДанныеСтрокиЗапись.СерияНоменклатуры),ДанныеСтрокиЗапись.СерияНоменклатурыПредставление) + " ; "
												+ Строка(ДанныеСтрокиЗапись.Тара) + " ; "
												//+ ПредставлениеПартии(ДанныеСтрокиЗапись.ПаспортПартии) + " ; "
												//+ Строка(ДанныеСтрокиЗапись.Коэффициент) + " ; "
												//+ Строка(ДанныеСтрокиЗапись.Количество) + " ; "
												//+ Строка(ДанныеСтрокиЗапись.Количество1) + " ; "
												+ Строка(ДанныеСтрокиЗапись.КоличествоМест) + " ; ";
												//+ Строка(ДанныеСтрокиЗапись.Тара) + " ; "
												//+ Строка(ДанныеСтрокиЗапись.Маркировка);
	
											КонецЕсли;	
											
	Возврат СтрокаПредставление;
КонецФункции

Функция ПредставлениеСтрокиПредупреждение(ДанныеСтрокиЗапись)
	СтрокаПредставление = "";
	Если ДанныеСтрокиЗапись.ПоСвойствам Тогда 
		 //Строка(ДанныеСтрокиЗапись.МаркаСплава) + " ; " + 
СтрокаПредставление = "Марка сплава:     " + Строка(ДанныеСтрокиЗапись.МаркаСплава) + "
			|Группа продукции: " + Строка(ДанныеСтрокиЗапись.ГруппаПродукции) + "
			|Тара:             " + Строка(ДанныеСтрокиЗапись.Тара) + "
			|Характеристика:   " + Строка(ДанныеСтрокиЗапись.ХарактеристикаНоменклатуры) + "
			|Серия:            " + Строка(ДанныеСтрокиЗапись.СерияНоменклатуры) + "
			|Маркировка:       " + Строка(ДанныеСтрокиЗапись.Маркировка) + "
			|Коэффициент:      " + Строка(ДанныеСтрокиЗапись.Коэффициент) + "
			|Количество:       " + Строка(ДанныеСтрокиЗапись.Количество) + "
			|Кол-во (доп.):    " + Строка(ДанныеСтрокиЗапись.Количество1) + "
			|Мест:             " + Строка(ДанныеСтрокиЗапись.КоличествоМест) + "
			|Кол-во (тара):    " + Строка(ДанныеСтрокиЗапись.КоличествоТара);
		
	Иначе	
СтрокаПредставление = "Номенклатура:     " + Строка(ДанныеСтрокиЗапись.Номенклатура) + "
			|Тара:             " + Строка(ДанныеСтрокиЗапись.Тара) + "
			|Характеристика:   " + Строка(ДанныеСтрокиЗапись.ХарактеристикаНоменклатуры) + "
			|Серия:            " + Строка(ДанныеСтрокиЗапись.СерияНоменклатуры) + "
			|Маркировка:       " + Строка(ДанныеСтрокиЗапись.Маркировка) + "
			|Коэффициент:      " + Строка(ДанныеСтрокиЗапись.Коэффициент) + "
			|Количество:       " + Строка(ДанныеСтрокиЗапись.Количество) + "
			|Кол-во (доп.):    " + Строка(ДанныеСтрокиЗапись.Количество1) + "
			|Мест:             " + Строка(ДанныеСтрокиЗапись.КоличествоМест) + "
			|Кол-во (тара):    " + Строка(ДанныеСтрокиЗапись.КоличествоТара);
	КонецЕсли;	
	Возврат СтрокаПредставление;
КонецФункции

