Перем мЭтоНовый,мНовыйЭлементМетал;

Процедура СоздатьНовыйЭлементМеталлопрокат(Отказ)
	
	Если ЭтоГруппа Тогда
				
		мНовыйЭлементМетал = Справочники.Номенклатура.СоздатьГруппу();
				
	Иначе
				
		мНовыйЭлементМетал = Справочники.Номенклатура.СоздатьЭлемент();
				
	КонецЕсли;
	
	СинхронизироватьДанные(мНовыйЭлементМетал);
	
	Если Не ЭтоГруппа Тогда
		
		мНовыйЭлементМетал.БазоваяЕдиницаИзмерения = Справочники.КлассификаторЕдиницИзмерения.НайтиПоНаименованию("кг",Истина);
		мНовыйЭлементМетал.ВидНоменклатуры = Справочники.ВидыНоменклатуры.НайтиПоРеквизиту("ТипНоменклатуры",Перечисления.ТипыНоменклатуры.Товар);
		мНовыйЭлементМетал.ВестиУчетПоХарактеристикам = Истина;
		мНовыйЭлементМетал.ВестиУчетПоСериям = Истина;
		мНовыйЭлементМетал.ВестиПартионныйУчетПоСериям = Истина;
		мНовыйЭлементМетал.СтавкаНДС = Перечисления.СтавкиНДС.НДС18;
		//устанавливаем вид воспроизводства, чтобы использовать планирование
		мНовыйЭлементМетал.ВидВоспроизводства = Перечисления.ВидыВоспроизводстваНоменклатуры.Производство;	
		
	КонецЕсли;	
	
	Попытка
		мНовыйЭлементМетал.Записать();
	Исключение
		Отказ = Истина;
	КонецПопытки;
	
	//Если ЭтоГруппа И мНовыйЭлементМетал.Уровень() = 3 Тогда
	//		Сообщить("Номенклатура Код: " + мНовыйЭлементМетал.Код+" Наименование: "+мНовыйЭлементМетал.Наименование);
	//КонецЕсли;	
	
	Металлопрокат = мНовыйЭлементМетал.Ссылка;
	
	Если Не ЭтоГруппа Тогда
		СоздатьЕдиницуИзмерения(мНовыйЭлементМетал);
	КонецЕсли;	
	
КонецПроцедуры

Процедура СоздатьЕдиницуИзмерения(мНовыйЭлементМетал)
	//СоздатьБазовую Единицу Измерения
	ЕдиницаОбъект = Справочники.ЕдиницыИзмерения.СоздатьЭлемент();
	ЕдиницаОбъект.Наименование            = мНовыйЭлементМетал.БазоваяЕдиницаИзмерения.Наименование;
	ЕдиницаОбъект.ЕдиницаПоКлассификатору = мНовыйЭлементМетал.БазоваяЕдиницаИзмерения;
	ЕдиницаОбъект.Коэффициент             = 1;
	
	ЕдиницаОбъект.Владелец                = мНовыйЭлементМетал.Ссылка;
	ЕдиницаОбъект.Записать();
	
	мНовыйЭлементМетал.ЕдиницаДляОтчетов =  ЕдиницаОбъект.Ссылка;
	мНовыйЭлементМетал.ЕдиницаХраненияОстатков =  ЕдиницаОбъект.Ссылка;
//ДОбавлено	20080129
	//Создать вторую Единицу Измерения
	ЕдиницаПоКлассификатору = Справочники.КлассификаторЕдиницИзмерения.НайтиПоНаименованию("т",Истина);
	Если НЕ ЕдиницаПоКлассификатору.Пустая() Тогда
		ЕдиницаОбъект = Справочники.ЕдиницыИзмерения.СоздатьЭлемент();
		ЕдиницаОбъект.Наименование            = ЕдиницаПоКлассификатору.Наименование;
		ЕдиницаОбъект.ЕдиницаПоКлассификатору = ЕдиницаПоКлассификатору;
		ЕдиницаОбъект.Коэффициент             = 1000;
		ЕдиницаОбъект.Владелец                = мНовыйЭлементМетал.Ссылка;
		ЕдиницаОбъект.Записать();
	КонецЕсли;
//ДОбавлено	20080129
	
КонецПроцедуры

Процедура РедактироватьЭлементМеталлопрокат(Отказ)
	
	Если НЕ Металлопрокат = Справочники.Номенклатура.ПустаяСсылка() Тогда
		Элемент = Металлопрокат.ПолучитьОбъект();
		СинхронизироватьДанные(Элемент);	
		Элемент.Записать();
	КонецЕсли;	
	
КонецПроцедуры

Процедура СинхронизироватьДанные(Элемент)
	
	Элемент.Наименование =  Наименование;
	Элемент.ПометкаУдаления =  ПометкаУдаления;
	
	Если Не ЭтоГруппа Тогда

		Элемент.НаименованиеПолное =  Наименование;
		//устанавливаем вид воспроизводства, чтобы использовать планирование
		Элемент.ВидВоспроизводства = Перечисления.ВидыВоспроизводстваНоменклатуры.Производство;	

	КонецЕсли;	
	
	//ГруппаМеталлопрокат = Справочники.Номенклатура.НайтиПоНаименованию("Металлопрокат", Истина);	
	ГруппаМеталлопрокат = Справочники.Номенклатура.НайтиПоНаименованию("МеталлопродукцияОЦМ", Истина);	
	
	Если  ГруппаМеталлопрокат.Пустая() Тогда
		
		НоваяГруппа = Справочники.Номенклатура.СоздатьГруппу();
		НоваяГруппа.Наименование = "МеталлопродукцияОЦМ";
		
		НоваяГруппа.Записать();
		ГруппаМеталлопрокат = НоваяГруппа.Ссылка;
	КонецЕсли;	
	 
	Если  Родитель.Металлопрокат.Пустая() Тогда 
		
		Элемент.Родитель = ГруппаМеталлопрокат;
		
	Иначе	
		
		Элемент.Родитель = Родитель.Металлопрокат;
		
	КонецЕсли;	
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ)
	
	мЭтоНовый	= ЭтоНовый();

	//Если Не Отказ И Не ОбменДанными.Загрузка Тогда
	//	
	//	Если ЭтоНовый() Тогда
	//		
	//		СоздатьНовыйЭлементМеталлопрокат(Отказ);
	//		
	//	Иначе
	//		
	//		РедактироватьЭлементМеталлопрокат(Отказ);
	//		
	//	КонецЕсли;
	//	
	//КонецЕсли;
	
КонецПроцедуры	

Процедура ПриЗаписи(Отказ)
	
	//Если Не Отказ И Не ОбменДанными.Загрузка Тогда
	//	
	//	Если мЭтоНовый Тогда
	//		
	//		мНовыйЭлементМетал.НоменклатураОЦМ_ск = Ссылка;
	//		мНовыйЭлементМетал.ОбменДанными.Загрузка = Истина;
	//		мНовыйЭлементМетал.Записать();
	//		
	//	КонецЕсли;
	//	
	//	//Если Не ЭтоГруппа Тогда
	//	//	ЗаписатьЗначенияСвойств(ПрочитатьЗаполнитьСвойстваИЗначения());
	//	//КонецЕсли;	
	//	
	//КонецЕсли;
	
КонецПроцедуры	

Процедура ПередУдалением(Отказ)
	
	
	
КонецПроцедуры	
