
#Область ПрограммныйИнтерфейс

// Цвет информационных надписей
//
Функция ЦветИнформационнойНадписи() Экспорт
	
	Возврат WebЦвета.СинийСоСтальнымОттенком;
	
КонецФункции

// Цвет итоговых надписей
//
Функция ЦветИтоговойНадписи() Экспорт
	
	Возврат WebЦвета.ТемноСиний;
	
КонецФункции

// Цвет ошибок
//
Функция ЦветПоляОшибка() Экспорт
	
	Возврат WebЦвета.Кирпичный;
	
КонецФункции

// Цвет фона помеченной кнопки
//
Функция ЦветПометкиКнопки() Экспорт
	
	Возврат WebЦвета.СеребристоСерый;
	
КонецФункции

// Цвет предупреждающего поля
//
Функция ЦветПредупреждающегоПоля() Экспорт
	
	Возврат WebЦвета.Кирпичный;
	
КонецФункции

#КонецОбласти
