
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("АвтоТест") Тогда
		Возврат;
	КонецЕсли;
	
	НастроитьФормуПоЗначениямНастроек();
	
	УстановленныйПароль = Константы.ПарольАдминистративногоРежима.Получить();
	
	Если НЕ ЗначениеЗаполнено(УстановленныйПароль) Тогда
		
		Элементы.СтарыйПароль.Видимость = Ложь;
		
	КонецЕсли;
	
	//ОриентацияЭкрана
	НастроитьФормуПоОриентацииЭкрана();
	
КонецПроцедуры

&НаСервере
Процедура ОбработкаПроверкиЗаполненияНаСервере(Отказ, ПроверяемыеРеквизиты)
	
	Если НЕ ЗначениеЗаполнено(УстановленныйПароль) Тогда
		ОбщегоНазначенияКлиентСервер.УдалитьЭлементИзМассива(ПроверяемыеРеквизиты, "СтарыйПароль");
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриИзмененииПараметровЭкрана()
	
	//ОриентацияЭкрана
	ПриИзмененииПараметровЭкранаСервер();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Готово(Команда)
	
	ОчиститьСообщения();
	Если ПроверитьЗаполнение() Тогда
		
		Если НЕ СтарыйПароль = УстановленныйПароль Тогда
			
			ТекстСообщения = НСтр("ru = 'Старый и установленный пароль не совпадают'");
			Сообщить(ТекстСообщения);
			Возврат;
			
		КонецЕсли;
			
		Если НовыйПароль = НовыйПарольПодтверждение Тогда
			
			СохранитьНаСервере();
			ПараметрыЗакрытия = "УстановленПароль";
			Оповестить("ИзмененАдминистративныйРежим");
			Закрыть(ПараметрыЗакрытия);
		Иначе
			
			ТекстСообщения = НСтр("ru = 'Пароль и подтверждение пароля не совпадают'");
			Сообщить(ТекстСообщения);
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура НастроитьФормуПоЗначениямНастроек()
	
	ОбщегоНазначения.УстановитьШрифт(ЭтаФорма);
	
КонецПроцедуры

&НаСервере
Процедура СохранитьНаСервере()
	
	Константы.ПарольАдминистративногоРежима.Установить(НовыйПароль);
	ОбновитьПовторноИспользуемыеЗначения();
	
КонецПроцедуры

#КонецОбласти

#Область ОриентацияЭкрана 

//ОриентацияЭкрана
&НаСервере
Процедура ПриИзмененииПараметровЭкранаСервер()
	
	ОбщегоНазначения.УстановитьОриентациюЭкрана();
	НастроитьФормуПоОриентацииЭкрана();
	
КонецПроцедуры

&НаСервере
Процедура НастроитьФормуПоОриентацииЭкрана()
	
КонецПроцедуры

#КонецОбласти
