
Процедура ПередЗаписью(Отказ)
	//Пресников
	Если ЭтоГруппа ИЛИ ОбменДанными.Загрузка = Истина тогда
		Возврат;
	КонецЕсли;
	
	Символ1 = Лев( Наименование, 1);
	Если Символ1 = "M" или Символ1 = "m" тогда
		Наименование = "М"+Сред( Наименование, 2);
	КонецЕсли;
		
	Если не ЗначениеЗаполнено( СплавУчета) тогда
		Если ЭтоНовый() тогда
			УстановитьСсылкуНового( Справочники.СК_МаркиСплавов.ПолучитьСсылку());
			СплавУчета = ПолучитьСсылкуНового();
		иначе
			СплавУчета = Ссылка;
		КонецЕсли;
	КонецЕсли;
	//Пресников
КонецПроцедуры
